#### Terraform Plan 📝`success`

<details><summary>Show Plan</summary>

```terraform
random_id.this: Refreshing state... [id=QpmL7gGXNng]
module.compute.tls_private_key.ssh: Refreshing state... [id=777cbe0f4f801a1ef6ecbb1573b8a6f1b54ef72e]
module.compute.local_file.private_key: Refreshing state... [id=4aea9b42c6fc5a5910933309fac668fcd3f8de9f]
data.aws_region.current: Reading...
module.compute.aws_key_pair.main: Refreshing state... [id=rss-key]
module.networking.data.aws_availability_zones.available: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0d5a60e92ea9ef031]
data.aws_caller_identity.current: Reading...
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::890742591881:oidc-provider/token.actions.githubusercontent.com]
module.compute.data.aws_ami.amazon_linux: Reading...
module.test_bucket.aws_s3_bucket.this: Refreshing state... [id=test-bucket-42998bee01973678]
aws_s3_bucket.terraform_state: Refreshing state... [id=rss-devops-terraform-state]
data.aws_region.current: Read complete after 0s [id=eu-north-1]
data.aws_caller_identity.current: Read complete after 0s [id=890742591881]
aws_iam_role.github_actions: Refreshing state... [id=GithubActionsRole]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonEventBridgeFullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848463100000006]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/IAMFullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848402200000005]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonEC2FullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848247900000004]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonSQSFullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848535200000007]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonS3FullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848031600000002]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonVPCFullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848011200000001]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonRoute53FullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848204200000003]
module.networking.data.aws_availability_zones.available: Read complete after 1s [id=eu-north-1]
module.compute.data.aws_ami.amazon_linux: Read complete after 1s [id=ami-0da6daf5e3e5ea2a8]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-06843732e6a0ee661]
module.security.aws_security_group.public: Refreshing state... [id=sg-062922a138d9d749f]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-041636c3aa721e47d]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-0c9d0540485dadf54]
module.security.aws_security_group.nat: Refreshing state... [id=sg-004b20151e71aed74]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-0f7e0b55def6e9796]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-0df370d69a460b54b]
module.security.aws_security_group.bastion: Refreshing state... [id=sg-06356fe67a0729ec9]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-07ec59e9ccf201110]
module.networking.aws_default_route_table.public: Refreshing state... [id=rtb-06872d2519e6988dd]
aws_s3_bucket_versioning.state: Refreshing state... [id=rss-devops-terraform-state]
aws_s3_bucket_object_lock_configuration.state: Refreshing state... [id=rss-devops-terraform-state]
aws_s3_bucket_server_side_encryption_configuration.state: Refreshing state... [id=rss-devops-terraform-state]
module.test_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=test-bucket-42998bee01973678]
module.security.aws_network_acl.public: Refreshing state... [id=acl-0cc179523f1629f49]
module.compute.aws_instance.nat: Refreshing state... [id=i-0b37de921800a2330]
module.security.aws_security_group.private: Refreshing state... [id=sg-03d11c0ab0e2b2e16]
module.compute.aws_instance.bastion: Refreshing state... [id=i-0a61f1e56b9cd1acb]
module.security.aws_security_group.k3s: Refreshing state... [id=sg-05686fb53299e6c08]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05d97631f68d1d0be]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07f7fd1c375eef5f1]
module.security.aws_network_acl.private: Refreshing state... [id=acl-0ea6342011e0888af]
module.k3s[0].aws_instance.k3s_master: Refreshing state... [id=i-025fa6895143f78c3]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0223c5646ee52e149]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ee8007a613d30e85]
aws_route.private_nat: Refreshing state... [id=r-rtb-07ec59e9ccf2011101080289494]
module.k3s[0].aws_instance.k3s_worker: Refreshing state... [id=i-0bdff5c264f70d7db]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.compute.aws_instance.nat will be updated in-place
  ~ resource "aws_instance" "nat" {
        id                                   = "i-0b37de921800a2330"
      ~ public_dns                           = "ec2-51-20-137-133.eu-north-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "51.20.137.133" -> (known after apply)
        tags                                 = {
            "Name" = "rss-nat"
        }
      ~ user_data                            = "3708c1781fb1890a3c93dc6aa69a9055ee7efeea" -> "76a5e840060abb12a91ab22dca74449057487126"
        # (37 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.compute.local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "modules/compute/keys/rss-key.pem"
      + id                   = (known after apply)
    }

  # module.k3s[0].aws_instance.k3s_master will be destroyed
  # (because module.k3s[0] is not in configuration)
  - resource "aws_instance" "k3s_master" {
      - ami                                  = "ami-0da6daf5e3e5ea2a8" -> null
      - arn                                  = "arn:aws:ec2:eu-north-1:890742591881:instance/i-025fa6895143f78c3" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "eu-north-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-025fa6895143f78c3" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "rss-key" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-09bf6899694689252" -> null
      - private_dns                          = "ip-10-0-3-53.eu-north-1.compute.internal" -> null
      - private_ip                           = "10.0.3.53" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0df370d69a460b54b" -> null
      - tags                                 = {
          - "Name" = "rss-k3s-master"
          - "Role" = "k3s-master"
        } -> null
      - tags_all                             = {
          - "Name" = "rss-k3s-master"
          - "Role" = "k3s-master"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "c67538d78824ad567aa2e615209883f0b14b430c" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-05686fb53299e6c08",
        ] -> null
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-09cc9863b9127e557" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.k3s[0].aws_instance.k3s_worker will be destroyed
  # (because module.k3s[0] is not in configuration)
  - resource "aws_instance" "k3s_worker" {
      - ami                                  = "ami-0da6daf5e3e5ea2a8" -> null
      - arn                                  = "arn:aws:ec2:eu-north-1:890742591881:instance/i-0bdff5c264f70d7db" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "eu-north-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0bdff5c264f70d7db" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "rss-key" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-07a071c480a5cb269" -> null
      - private_dns                          = "ip-10-0-4-54.eu-north-1.compute.internal" -> null
      - private_ip                           = "10.0.4.54" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-041636c3aa721e47d" -> null
      - tags                                 = {
          - "Name" = "rss-k3s-worker"
          - "Role" = "k3s-worker"
        } -> null
      - tags_all                             = {
          - "Name" = "rss-k3s-worker"
          - "Role" = "k3s-worker"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "49a515f6ae7a45047e5f2c11a2251391d071435c" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-05686fb53299e6c08",
        ] -> null
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-018867258a3d591c0" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  - k3s_master_ip           = "10.0.3.53" -> null
  - k3s_worker_ip           = "10.0.4.54" -> null
  ~ nat_public_ip           = "51.20.137.133" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>